app/controllers/setup_controller.rb

INSERT INTO "gyms" ("created_at", "name", "updated_at", "website") VALUES (?, ?, ?, ?)  [["created_at", Wed, 09 Oct 2013 16:23:05 UTC +00:00], ["name", "samalkot"], ["updated_at", Wed, 09 Oct 2013 16:23:05 UTC +00:00], ["website", nil]]
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "gym_id", "last_sign_in_at", "last_sign_in_ip", "name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "role", "sign_in_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "last_sign_in_at" = '2013-10-09 16:23:05.179557', "current_sign_in_at" = '2013-10-09 16:23:05.179557', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2013-10-09 16:23:05.181549' WHERE "users"."id" = 1
---
  def create
    params[:user][:role] = "owner";
    super

    if( !@user.id.nil? )
      @gym = Gym.new
      @gym.name = params[:gym_name]
      @gym.save
      @user.gym_id = @gym.id
      #@user.name = params[:name]
      @user.save!